In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
train_path = "data/train.csv"
test_path = "data/test.csv"

In [4]:
train_df = pd.read_csv(train_path)
print(train_df.shape)
train_df.head()

(8500, 6)

   ID     AT      V       AP     RH      EP
0   1  28.62  69.71  1009.67  62.12  437.52
1   2  14.84  41.48  1017.26  63.42  460.30
2   3  26.04  74.67  1016.68  81.20  433.55
3   4  13.55  42.99  1007.58  97.55  470.82
4   5  20.10  59.87  1018.97  87.23  444.71

In [5]:
test_df = pd.read_csv(test_path)
print(test_df.shape)
test_df.head()

(1068, 5)

     ID     AT      V       AP     RH
0  8501   8.91  40.69  1015.11  89.65
1  8502  25.63  48.92  1009.99  34.64
2  8503  18.98  60.10  1010.09  85.34
3  8504   8.02  39.04  1018.49  68.07
4  8505  34.10  73.03  1014.01  41.26

In [8]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8500 entries, 0 to 8499
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      8500 non-null   int64
 1   AT      8500 non-null   float64
 2   V       8500 non-null   float64
 3   AP      8500 non-null   float64
 4   RH      8500 non-null   float64
 5   EP      8500 non-null   float64
dtypes: float64(5), int64(1)
memory usage: 398.6 KB

In [6]:
train_df.describe()

,ID,AT,V,AP,RH,EP
count,8500.000000,8500.000000,8500.000000,8500.000000,8500.000000,8500.00000
mean,4250.500000,19.656261,54.310672,1013.254513,73.354868,454.33872
std,2453.882977,7.451720,12.699757,5.936605,14.628062,17.06837
min,1.000000,1.810000,25.360000,992.890000,25.560000,420.26000
25%,2125.750000,13.527500,41.740000,1009.117500,63.380000,439.72750
50%,4250.500000,20.360000,52.080000,1012.945000,75.025000,451.44000
75%,6375.250000,25.712500,66.540000,1017.240000,84.920000,468.43000
max,8500.000000,35.770000,80.250000,1033.290000,100.160000,495.76000

In [7]:
train_df.isnull().sum()

ID    0
AT    0
V     0
AP    0
RH    0
EP    0
dtype: int64